<template>
  <div class="news-content">
    <el-card>
      <div slot="header" class="clearfix">
        <el-breadcrumb separator-class="el-icon-arrow-right">
          <el-breadcrumb-item :to="{ path: '/' }">首页</el-breadcrumb-item>
          <el-breadcrumb-item :to="id ? { path: `/news/${type}` } : ''">{{info.title}}</el-breadcrumb-item>
          <el-breadcrumb-item v-if="id">{{info['article'][id].title}}</el-breadcrumb-item>
        </el-breadcrumb>
      </div>

      <!-- <div v-if="type - 4 === 0" class="download">
        <el-row :gutter="20">
          <el-col :span="12">
            <div class="download-title">安卓下载</div>
            <div class="download-img">
              <img
                src="
                alt
              >
            </div>
            <div class="download-tips">扫码下载</div>
          </el-col>
          <el-col :span="12">
            <div class="download-title">IOS下载</div>
            <div class="download-img">
              <img
                src=""
                alt
              >
            </div>
            <div class="download-tips">扫码下载</div>
          </el-col>
        </el-row>
      </div> -->
      <div>
        <div class="list" v-if="!id">
          <ul style="padding-left:20px;">
            <li
              v-for="item in lists[type].news"
              :key="item.title"
              @click="$router.replace({name:'news',params:{type:type},query:{id:item.id}})"
            >
              {{item.title}}
              <span>{{item.date}}</span>
            </li>
          </ul>
        </div>
        <div class="article" v-else>
          <h3>{{info['article'][id].title}}</h3>
          <div v-html="info['article'][id].content"></div>
        </div>
      </div>
    </el-card>
  </div>
</template>
<script>
export default {
  data () {
    return {
      lists: {
        '1': {
          title: '公告中心',
          news: [
            {
              id: 1,
              title: '提现奖励更改通知！',
              date: '2019-03-04'
            },
            {
              id: 2,
              title: '买手与商家注意事项! ',
              date: '2019-03-04'
            }
          ],
          article: {
            '1': {
              title: '提现奖励更改通知！',
              content:
                '<p>各位亲，提现奖励活动截止到今天就结束了！</p><p>今后提现依旧保持无门槛无手续费规则。</p><p>但随着任务量的增加，及客单价的提高，提现奖励将更改为500起提奖励3元，1000元起提奖励6元，以此类推！望周知！</p>'
            },
            '2': {
              title: '买手与商家注意事项!',
              content: [
                '<h4 class="red">接手任务六大注意事项</h4>',
                '<p>一、严禁通过旺旺联系发布方或旺旺聊天中带有平台、提升销量等忌讳字眼 ；</p>',
                '<p>二：禁止在任务过程中，辱骂任务一方，出言不逊；</p>',
                '<p>三、禁止使用花呗、淘金币、天猫积分、返利网、淘宝客、信用卡支付；</p>',
                '<p>四、必须物流信息签收后才能在淘宝确认收货！（无法获取物流信息的联系发布方）;</p>',
                '<p>五、禁止以任何理由给对方差评及非五星好评等行为；</p>',
                '<p>六、严禁好评乱写评语，广告评语或恶意乱写评语。</p>',
                '<h4 class="red">发布任务三大注意事项</h4>',
                '<p>一、禁止发布方发布不实任务，骗取流量！</p>',
                '<p>二、禁止发布一个任务却以各种理由让接手方拍淘宝多个商品/链接；</p>',
                '<p>三、禁止发布方不勾选对应要求却在留言中要求接手完成，如"货比三家"。</p>'
              ].join('')
            }
          }
        },
        '2': {
          title: '新手帮助',
          news: [
            {
              id: 1,
              title: '新手常见问题解答（买手版）',
              date: '2019-03-04'
            }
          ],
          article: {
            '1': {
              title: '新手常见问题解答（买手版）',
              content: [
                '<h4>1、生财有道是什么？</h4>',
                '<p>生财有道（网址：http://mms.la55l.cn）是一个自助接任务赚钱平台，只要你有主流电商（淘宝、京东、拼多多）账号懂网购，即可注册平台赚钱</p>',
                '<h4>2、怎么使用生财有道？</h4>',
                '<p>注册账号-完成实名认证-绑定银行卡及各平台买号-接任务做单</p>',
                '<p>视频-注册账号、视频-实名认证、视频-绑定银行卡及买号</p>',
                '<p>视频-接任务（看附件）</p>',
                '<h4>3、平台任务注意事项</h4>',
                '<p>禁止使用返利软件、不能使用淘金币、集分宝、平台券（付款界面可以关闭），一旦发现违规刷单且不配合，将冻结账号及账号资金。</p>',
                '<h4>4、返款及提现方式？</h4>',
                '<p>返款方式：本金（完成任务，任务无误2小时后）立返，佣金货返</p>',
                '<p>资金提现：会员中心-资金提现</p>',
                '<h4>5、提现到账时间？</h4>',
                '<p>周一到周五18点财务统一处理提现申请并打款，周末及节假日提现顺延至第一个工作日18点处理</p>',
                '<h4>6、如何拉好友注册平台做任务还能赚钱？</h4>',
                '<p>点击“我要推广-复制生成链接”，将链接发送给好友，好友通过你的推广链接注册平台并完成任务，你都有奖励，每单奖励0.3元</p>',
                '<h4>7、超过2小时未返款还未返款？</h4>',
                '<p>发送“任务截图+订单截图”给微信客服小岛登记，确认没问题会统一催促商家核实打款</p>',
                '<h4>8、商家发布任务要求付款金额与任务要求拍下商品规格价格不一致怎么办？</h4>',
                '<p>有3种方案可选择：</p>',
                '<p>1、取消任务；</p>',
                '<p>2、购买商品规格中价格与商家要求价格一致的商品；</p>',
                '<p>3、按照商家要求规格购买，填写实际付款金额，然后按照超过2小时候未返款操作反馈给客服小岛。不要拍错了而且填写订单后，随意去退款！！</p>',
                '<h4>9、一个账号可以添加几个买号？有什么限制？</h4>',
                '<p>每个平台都可以绑定2个账号，同一个平台绑定的2个账号地址不要一样！</p>',
                '<p>1个平台账号24小时可以接4单，2个账号24小时接8单</p>',
                '<h4>10、接任务、做任务过程遇到弹窗怎么处理？</h4>',
                '<p>提示已接4单/平台没有任务：说明这个账号刷单达到限额或没有可接任务，晚点再接任务试试</p>',
                '<p>提示其他内容弹窗：不用理会，多点几次接任务就可以</p>',
                '<p>做任务过程提示订单号重复、非法操作等内容：清理下手机或者浏览器缓存，返回上一步，继续操作即可</p>',
                '<h4>11、被商家投诉怎么办？</h4>',
                '<p>看清商家投诉原因，按商家要求操作。如对投诉有意见可微信联系平台客服小岛（微信号：xj13338497848）处理。</p>'
              ].join('')
            }
          }
        },
        '3': {
          title: '电商资讯',
          news: [
            {
              id: 1,
              title: '淘宝店铺推广中如何做到不烧钱赚流量',
              date: '2019-03-04'
            },
            {
              id: 2,
              title: '如何通过站外博客群快速引流店铺人气',
              date: '2019-03-04'
            }
          ],
          article: {
            '1': {
              title: '淘宝店铺推广中如何做到不烧钱赚流量',
              content: [
                '<h4>拟好宝贝标题，吸引眼球，事半功倍</h4>',
                '<p>店铺信誉低，所以店长就在想当宝贝被展现在买家面前店长怎样才能把它吸引过来。肯定很多人都会想到宝贝的图片、标题，店长也是这么想的。图片太复杂的处理店长不会，但是拟标题可就不是什么太难的事。</p>',
                '<h4>合理设置关键词，提升点击量，减少花费</h4>',
                '<p>在选定推广的宝贝，拟好标题之后最重要的添加关键词就来了。系统会根据搜索量给你推荐出来一些关键词：</p>',
                '<p>这里学问可就大了，有些是精准关键词，而有些是范围很大的模糊关键词。比如图示中的头绳发圈韩国就属于精准关键词，而发圈就属于类目较大的模糊关键词了。那么店长们应该怎么添加关键词呢，根据系统的推荐店长们可以4:6的选择添加关键词。就是百分之四十的精准关键词，百分之六十的模糊关键词。还有关键词一定不能添加的太少，多了些没有用的也没关系，过几天店长们可以把没有展现量的关键词删除替换。</p>',
                '<h4>巧妙设置关键词出价，一举多得</h4>',
                '<p>添加好关键词就该设置关键词出价了。出价越高你所推荐的宝贝就越靠前，但是对于小卖家来说是经不起这样折腾的！宝贝排在5页左右的位置其实也是很不错的！所以要根据关键词的市场平均出价的一半再加上0.1元。具体举个例子吧：上图中“发圈”这个关键词的市场平均出价是0.5元。那么默认出价就是0.5/2+0.1=0.35！这个0.35就是店长的出价。为什么这样出价呢，大致应该是一般人出价在平均价之下，另一半人出价要高于平均价，所以平均价的一半再加上0.1元店长相信这个出价会至少关于1/3人的出价，这样一来店长们推广宝贝的排名相对就比较靠前，而且花费又大大的降低下来！</p>',
                '<h4>淘宝论坛、淘宝社区宣传</h4>',
                '<p>1、设置淘宝论坛、淘宝社区个人头像和签名。这个要让所有人看到你的第一眼就知道你卖的宝贝是什么，最近有什么活动。</p>',
                '<p>2、发帖。在社区发帖时，一定不要发广告贴，但是可以发一些紧随你宝贝主题的帖子。比如：你的宝贝是厨具，你可以写一些怎么挑选厨具以及做菜的窍门之类的帖子；如果你的宝贝是床上用品，你可以写一些如何促进睡眠的帖子；如果你的是服装，可以发一些韩国明星的图片，然后对其服饰进行剖析。</p>',
                '<h4>淘宝客推广</h4>',
                '<p>淘宝客推广是一种按成交计费的推广模式，买家只要从淘宝客推广专区获取了宝贝的代码，那么买家要经过淘宝客的推广，进入卖家店铺完成购买后，淘宝客就可以得到由卖家支付的佣金。淘宝客推广的形式包括推广单件宝贝、推广整个类目的宝贝、推广整个店铺等。</p>'
              ].join('')
            },
            '2': {
              title: '如何通过站外博客群快速引流店铺人气',
              content: [
                '<p>近些年来，互联网发展的非常迅速，电子商务购物大潮正以不可阻挡的趋势向我们袭来,而且网民质素也在不断提升,加之淘宝网店近年来所取得的长足发展,我们足以预见,淘宝购物对很多人来说已经不再陌生,所以我们不必担心淘宝店外的推广能否为我们带来客源,答案绝对是肯定的. </p>',
                '<p>近年来,博客作为一种长期稳定的强大的营销平台,已得到越来越多企业的重视,不少企业都开始建立起自己的博客营销平台.而走在电子商务最前沿的淘宝网店,由于其内部竞争越来越激烈,不少有远见的卖家也开始“两手抓”的“整风运动”,一手抓淘宝内推广,一手抓淘宝外推广.随着中国网民的急剧增加以及网民素质的不断提升,从长远来看,这是非常明智的做法.但如何有效地应用博客平台来推广网店呢?这点相信大多数卖家还是含糊不清的.下面我们来看一份较完整的针对淘宝店的博客推广的实施方案.</p>',
                '<h4>一、建立博客群</h4>',
                '<p>计划推广的10大博客:</p>',
                '<p>①百度空间(百度收录上具有优先权)</p>',
                '<p>②新浪(更新速度的优势以及广泛的人气优势)</p>',
                '<p>③搜狐</p>',
                '<p>④163</p>',
                '<p>⑤Bokee</p>',
                '<p>⑥网友天下</p>',
                '<p>⑦和讯博客</p>',
                '<p>⑧Blogbus</p>',
                '<p>⑨51 博客</p>',
                '<p>⑩博客中国</p>',
                '<p>当然,在实际执行中,各卖家可根据自己的行业特征及需要,选择适合自己的博客平台及决定推广的博客数量.</p>',
                '<h4>二、博客推广的实施步骤:</h4>',
                '<p>①博客注册</p>',
                '<p>注意点:(1)统一博客的URL后缀路径名:统一注册为xxx/xxx;(2)10博客注册的帐号、密码统一并做好登记.(3)博客标题体现一些重要的关键字</p>',
                '<p>②博客界面完善</p>',
                '<p>注意点:完善的内容包括:博客的命名、关键字选取及分布、博客简介填写、友情链接、图片上传、博客界面风格选取(尽量选择女性化、娱乐性强的模板风格)</p>',
                '<p>③博客内容填充(重点)</p>',
                '<p>注意点:</p>',
                '<p>(1)题材:我们初期以转载文章为主,初定题材范围有:女包选购及保养指南;淘宝店购物、网上购物指南;夏季女装搭配指南;淘宝开店指南等.</p>',
                '<p>(2)每日工作流程:每日早上准备好10篇文章,分别发布到10个博客平台;每篇文章后面加入“xxx网店”的简介资料,并为文中一些关键字加入超链接,直达“xxx网店”首页.另外,上传一些精美的包包图片并以重要的关键字描述图片,这点非常重要!</p>',
                '<p>④博客宣传推广</p>',
                '<p>(1)主推百度、新浪两博客;</p>',
                '<p>(2)利用“博客互踩软件”每天定时访问别人的博客;(3)到名人、名星博客留言;(4)与人气高的博客申请友情链接</p>',
                '<p>⑤提交博客地址到各著名博客搜索引擎</p>',
                '<p>维持好博客群间关系:</p>',
                '<p>⑥按以上步骤建立好上面提到的10个博客地址</p>',
                '<p>⑦10个博客之间互相友情链接,每个博客都有“xxx网店”的首页链接</p>',
                '<h4>三、博客内容发布注意事项:</h4>',
                '<p>①每篇博客文章后都有一小段关于“xxx网店”的介绍,提供网店的网址.</p>',
                '<p>②转载过来的文章必须要更改标题和适当调整网站内容.</p>',
                '<p>③一周一到两篇原创软文,软文发在所有博客上.(后期目标)</p>'
              ].join('')
            }
          }
        },
        '4': {
          title: '下载APP'
        }
      },
      type: '1',
      id: null,
      info: {}
    }
  },
  watch: {
    $route: function (to) {
      this.initParams(to)
    }
  },
  created () {
    this.initParams(this.$route)
  },
  methods: {
    /**
     * @description 初始化页面参数
     */
    initParams (val) {
      this.type = val.params.type
      this.id = val.query.id
      this.info = this.lists[this.type]
    }
  }
}
</script>

<style lang="scss">
.news-content {
  .el-card {
    min-height: 500px;
  }
  .el-card__body {
    padding: 20px 30px 50px;
  }
  .list {
    ul {
      margin: 0;
    }
    li {
      padding: 15px 0;
      border-bottom: 1px dotted #dcdfe6;
      font-size: 16px;
      line-height: 30px;
      cursor: pointer;
      span {
        float: right;
        font-size: 14px;
        color: #606266;
      }
    }
  }
  .article {
    p {
      font-size: 14px;
      color: #606266;
    }
    .red {
      color: red;
    }
  }
  .download {
    padding: 0 50px;
  }
  .download-title {
    margin: 30px auto 10px;
    font-size: 20px;
    text-align: center;
    font-weight: 600;
  }
  .download-img {
    width: 180px;
    height: 180px;
    margin: 0 auto;
    img {
      width: 100%;
      height: 100%;
    }
  }
  .download-tips {
    width: 130px;
    margin: 20px auto;
    border: 1px solid #333;
    border-radius: 38px;
    line-height: 38px;
    text-align: center;
    font-weight: 500;
  }
}
</style>
